InformationRegisters/РИНЭКО_ИсторияОбсуждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>РИНЭКО_ИсторияОбсуждений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕстьПланМероприятия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РИНЭКО_ИсторияОбсуждений/Ext/ManagerModule.bsl
// + [Rineco], [Киселев А.Н.] [19.10.2021] 
// Задача: [№ 20449], [# Добавляем запись]
Процедура ДобавитьНовуюЗапись(Отправитель,Объект,Сообщение,ЕстьПлан) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РИНЭКО_ИсторияОбсуждений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Отправитель = Отправитель;
	МенеджерЗаписи.Договор = Объект;
	МенеджерЗаписи.ЕстьПланМероприятия = ЕстьПлан;
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
